#ifndef __TK_CONF_ADD_H_
#define __TK_CONF_ADD_H_
//-------------- <<< Use Configuration Wizard in Context Menu >>> --------------
//<o0>Select IC <0=>SH79F3212 <1=>SH79F6412 <2=>SH79F3218 <3=>SH79F9660 <4=>SH79F9662 <5=>SH79M1634 <6=>SH79F1622 <7=>SH79F1631 <10=>SH79F326 <11=>SH79F328 <12=>SH79F3221 <13=>SH79F1640 <14=>SH79F3281 <15=>SH79F6428 <16=>SH79F6481 <17=>SH79F6482 <18=>SH79F9260 <19=>SH79F9262 <20=>SH79F9263 <21=>SH79F9661 <22=>SH79F9461 <23=>SH79F9462 <24=>SH79M9280 
#define	chip_sel  11
//------------------------------------------------------------------
//<h>Touch Global Config
//<i>配置Touch通道个数、频率、参考电压、去抖次数、噪声阈值等全局参数
//	<o0>Touch Key Number <1-17>	
//	<o1>Touch High Frequence(Defalut:10) <1-127>
//	<o2>Touch Low Frequence(Defalut:18) <1-127>
//	<o3.6..7>VREF Select(建议:1.0V,鼠标停在该位置查看电压点) <0=>VREF4 <1=>VREF3 <2=>VREF2 <3=>VREF1
//	<i>内部基准电压选择VREF4 ,3212/6412/3218/9660/9662/1634/1622/1631 2.5V,其它IC 2.0V
//	<i>内部基准电压选择VREF3 ,3212/6412/3218/9660/9662/1634/1622/1631 2.0V,其它IC 1.5V
//	<i>内部基准电压选择VREF2 ,3212/6412/3218/9660/9662/1634/1622/1631 1.5V,其它IC 1.0V
//	<i>内部基准电压选择VREF1 ,3212/6412/3218/9660/9662/1634/1622/1631 1.0V,其它IC 0.6V
//  <i>内部基准电压选择:************VOP电压必须大于VREF*******************************
//	<o4.2..3>VOP Select(建议:3.0V,鼠标停在该位置查看电压点) <0=>VOP4 <1=>VOP3 <2=>VOP2 <3=>VOP1
//	<i>OP输出电压选择VOP4 ,3212/6412/3218/9660/9662/1634/1622/1631 4.0V,其它IC 4.0V
//	<i>OP输出电压选择VOP3 ,3212/6412/3218/9660/9662/1634/1622/1631 3.0V,其它IC 3.0V
//	<i>OP输出电压选择VOP2 ,3212/6412/3218/9660/9662/1634/1622/1631 2.5V,其它IC 2.0V
//	<i>OP输出电压选择VOP1 ,3212/6412/3218/9660/9662/1634/1622/1631 2.0V,其它IC 1.2V
//  <i>OP输出电压选择:************VOP电压必须大于VREF******************************
//	<o5>Debounce Count(Default:3) <2-10>
//	<i>Touch按键去抖次数
//	<o6>Noise Threshold(Default:30) <0-100>
//	<i>噪声阈值
//	<o7>Multikey Number(Default:3) <1-17>
//	<i>多按键个数(取值范围：1 - KeyNumber)
//</h>
/*----------------------------------------------------*/
/*             1.  Touch 调试参数                     */
/*----------------------------------------------------*/
//按键个数
#define KEY_NUMBER1        16  		//按键总个数，取值范围（1~17）
//扫描频率
#define HF_TKST            10
#define LF_TKST            18
#define	Vref			   0x80
#define Vop				   0x04

#define FLAG_COUNT      	3    	//用来调节debance次数
#define normal_jitter  		30    	//用来定义在正常情况下数据的抖动量
#define multikey_num    	3  		//用来控制多键的个数	//lmy1207
//==========================================================================
//<h>Touch Channel Config
//<i>配置按键通道及对应手指阈值
//	<h>key0
//	<i>按键0对应触摸通道及手指阈值选择
//		<o0>Touch Key0 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o17>Touch Key0 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key1
//	<i>按键1对应触摸通道及手指阈值选择
//		<o1>Touch Key1 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o18>Touch Key1 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key2
//	<i>按键2对应触摸通道及手指阈值选择
//		<o2>Touch Key2 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o19>Touch Key2 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key3
//	<i>按键3对应触摸通道及手指阈值选择
//		<o3>Touch Key3 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o20>Touch Key3 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key4
//	<i>按键4对应触摸通道及手指阈值选择
//		<o4>Touch Key4 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o21>Touch Key4 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key5
//	<i>按键5对应触摸通道及手指阈值选择
//		<o5>Touch Key5 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o22>Touch Key5 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key6
//	<i>按键6对应触摸通道及手指阈值选择
//		<o6>Touch Key6 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o23>Touch Key6 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key7
//	<i>按键7对应触摸通道及手指阈值选择
//		<o7>Touch Key7 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o24>Touch Key7 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key8
//	<i>按键8对应触摸通道及手指阈值选择
//		<o8>Touch Key8 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o25>Touch Key8 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key9
//	<i>按键9对应触摸通道及手指阈值选择
//		<o9>Touch Key9 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o26>Touch Key9 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key10
//	<i>按键10对应触摸通道及手指阈值选择
//		<o10>Touch Key10 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o27>Touch Key10 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key11
//	<i>按键11对应触摸通道及手指阈值选择
//		<o11>Touch Key11 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o28>Touch Key11 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key12
//	<i>按键12对应触摸通道及手指阈值选择
//		<o12>Touch Key12 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o29>Touch Key12 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key13
//	<i>按键13对应触摸通道及手指阈值选择
//		<o13>Touch Key13 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o30>Touch Key13 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key14
//	<i>按键14对应触摸通道及手指阈值选择
//		<o14>Touch Key14 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o31>Touch Key14 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key15
//	<i>按键15对应触摸通道及手指阈值选择
//		<o15>Touch Key15 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24 
//		<o32>Touch Key15 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//	<h>key16
//	<i>按键16对应触摸通道及手指阈值选择
//		<o16>Touch Key16 Select <0=>TK0 <1=>TK1 <2=>TK2 <3=>TK3 <4=>TK4 <5=>TK5 <6=>TK6 <7=>TK7 <8=>TK8 <9=>TK9 <10=>TK10 <11=>TK11 <12=>TK12 <13=>TK13 <14=>TK14 <15=>TK15 <16=>TK16 <17=>TK17 <18=>TK18 <19=>TK19 <20=>TK20 <21=>TK21 <22=>TK22 <23=>TK23 <24=>TK24
//		<o33>Touch Key16 Finger Threshold(Default:40%) <20=>20% <25=>25% <30=>30% <35=>35% <40=>40% <45=>45% <50=>50% <55=>55% <60=>60% <65=>65% <70=>70% <75=>75% <80=>80% 
//	</h>
//</h>

#define key0              23
#define key1              22
#define key2              21
#define key3              20
#define key4              9
#define key5              12
#define key6              10
#define key7              11
#define key8              8
#define key9              7
#define key10             6
#define key11             5
#define key12             4
#define key13             3
#define key14             2
#define key15             1
#define key16             17
//---------------------------------------------------
// 触摸按键阈值百分比配置表 (0~100)
// 建议根据实际触感调整该配置，从而调整各按键灵敏度
//---------------------------------------------------
#define Thrd_Per0          30
#define Thrd_Per1          30
#define Thrd_Per2          30
#define Thrd_Per3          30
#define Thrd_Per4          30
#define Thrd_Per5          30
#define Thrd_Per6          30
#define Thrd_Per7          30
#define Thrd_Per8          30
#define Thrd_Per9          30
#define Thrd_Per10         30
#define Thrd_Per11         30
#define Thrd_Per12         30
#define Thrd_Per13         30
#define Thrd_Per14         30
#define Thrd_Per15         30
#define Thrd_Per16         40
//==============================================================

//<e0>Touch Debug
//<i>触摸调试模式:可选择校准功能或触摸数据UART传输功能(UART波特率固定为115200)
//	<e1>Enable Touch Adjust Function
//	<i>触摸校准功能
//	</e>
//	<e2>Enable UART Communication
//	<i>触摸数据UART传输功能
//	</e>
//	<o4>Select UART <0=>EUART0 <1=>EUART1 <2=>EUART2
//	<i>选择UART接口
//	<h>UART0 Pin Select
//		<o5.4..6>TXD0 <0=>P00 <1=>P01 <2=>P02 <3=>P03 <4=>P26 <5=>P27 <6=>P52 <7=>P53
//		<o5.0..2>RXD0 <0=>P00 <1=>P01 <2=>P02 <3=>P03 <4=>P26 <5=>P27 <6=>P52 <7=>P53
//	</h>
//	<h>UART1 Pin Select
//	<o6.4..6>TXD1 <0=>P26 <1=>P27 <2=>P40 <3=>P41 <4=>P42 <5=>P43 <6=>P50 <7=>P51
//	<o6.0..2>RXD1 <0=>P26 <1=>P27 <2=>P40 <3=>P41 <4=>P42 <5=>P43 <6=>P50 <7=>P51
//	</h>
//</e>
//	<h>Add Function
//	<i>新增功能
//	<e7.0> Enable Key realse Function
//	<i> 按键释放功能
//	</e>
//	<e7.1> Enable Nake Function
//	<i> 按键裸触功能
//  <o8>Nake Vale(Defalut:1500) <1-65535>
//	<i> 裸触阈值
//	</e>
//	<e7.2> Enable 3Times Filter Function
//	<i> 硬件3次滤波
//	</e>
//	<e7.7> Enable Two Freqency 'AND' Judge
//	<i> 双频与判键
//	</e>
//	</h>

//校准及数据传送总使能开关
#define EN_DataAdjust  	0 		//  0 ---- 关闭校准功能以及数据传送功能 
						 		//  1 ---- 可配置开启校准功能或数据传送功能
/*----------------------------------------------------*/
/*             2.  Touch 校准使能                     */
/*  说明：校准Touch检测通道时开启该功能，可通过‘4’选  */
/*        择通讯串口								  */
/*----------------------------------------------------*/
#define Touch_Adjust   	0 		//  0 ---- 关闭校准功能（正常使用时需关闭该功能能）
						 		//  1 ---- 使能校准功能

/* 注：校准及数据观测功能同时打开时，仅校准功能生效   */

/*----------------------------------------------------*/
/*             3. Touch数据观测选择                   */
/*  说明：供Tocuh调试使用，可通过‘4’选择通讯串口      */
/*----------------------------------------------------*/
#define		UART_EN		1 		//1 使能数据观测功能
						  		//0 不使能数据观测功能					

#define		L_Send      0 		//0 不发送数据
				   		 		//1 发低频基线+滤波后的值	
						 		//2 发低频基线+滤波前的值
						 		//3 发高频基线+滤波后的值
						 		//4 发高频基线+滤波前的值
						 		//5 发高/低频基线+滤波后的值
						 		//6 发高/低频基线+滤波前的值
						 		//7 发送matlab调试平台数据
/*----------------------------------------------------*/
/*              4.	  串口配置                        */
/*----------------------------------------------------*/
//UART选择
#define		UART_Sel	2 		//0 -->UART0
						  		//1 -->UART1	
						  		//2 -->UART2
//UART引脚选择
#define	    UART0_PIN 	0x10 	//UART0脚位选择
#define	    UART1_PIN   0x93 	//UART1脚位选择 
//UART2_PIN  固定P2.1/P2.0, UART2无需映射脚位
/*----------------------------------------------------*/
/*              5.	  新增功能                        */
/*----------------------------------------------------*/
#define     Function	0x83	//无新增功能
								//Bit0 = 1 : 使能按键释放判断功能
								//Bit1 = 1 : 使能裸触
								//Bit7 = 1 : 双频“与”判键，为0是双频“或”判键
								//若多个Bit为1，则多功能同时有效

#define		Nake_Value	1500	//裸触阈值	 
/*----------------------------------------------------*/
/*              6.	  其他配置                       */
/*----------------------------------------------------*/
#define     OtherSet	0x02	//默认功能：开启斜率约束关闭基线复位及对讲机功能
								//Bit0 = 1 : 开启斜率约束功能
								//Bit1 = 1 : 开启基线复位功能
								//Bit2 = 1 : 有对讲机干扰跳频判键,为0则按键值清零
								//Bit3 = 1 : 使能对讲机功能
//--------------------------对讲机参数--------------------------
#define Dui_num_set			5	  //异常通道个数≥该值，则认为存在对讲机干扰（建议值KeyNum/2）
#define	L_Inter1_set   	    8	  //所有按键 delta > key_threshold*L_Inter1/10 时屏蔽按键输出（建议范围2~20）
#define L_Inter2_set   	    5	  //         delta < key_threshold*L_Inter2/10 时使能按键输出（建议范围2~10）
//--------------------------基线复位参数--------------------------
#define StableLimit_set1	20	  //两频率按键置起的时间间隔超过该值认为是异常，不算按下（仅在选择双频与判键时有效）
#define	STcnt_One_set   	500  //单个频率基线异常复位时间（当选择或判键时，该值建议设置较大，当选择与判键时该值可适当减小）
#define STcnt_Two_set   	2000  //双频基线异常复位时间
//-------------------- <<< end of configuration section >>> --------------------

#endif

